## Pandas :

* Pandas is a library in python which is used to perform data anlysis.
* Pandas will reduce comlexity and make our work very easy.
* It can be applicable for any type of data(ordered or unordered)
* The ouput will be in the format of tabular form.That tabular form is named as DataFrame.
* This can be applied for different file formats like csv,excel,pdf,json and etc.

#### Main Key words in creating our data using pandas:

* **Series**: 
    * This series is a 1-d array. 
    * The output will be in the format of row by row(line to line).
    
* **Data Frame**:
    * In this the data will be represented in the format of rows and columns in a tabular arrangement

##### Importing the Pandas library:

In [3]:
import pandas as pd
import numpy as np

In [4]:
### Creating data using Series:
### pd.Series(list)

a = pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
### Creating Series using Numpy array:
### pd.Series(np.array(list))

a = pd.Series(np.array([1,2,3,4]))
a

0    1
1    2
2    3
3    4
dtype: int32

In [6]:
### Creating Data Series using Dictionary:

d = {'a' : 0,"b" : 1,"c" : 2}
d

{'a': 0, 'b': 1, 'c': 2}

In [9]:
a = pd.Series(d)
a

a    0
b    1
c    2
dtype: int64

In [11]:
b = pd.Series({'a' : 0,"b" : 1,"c" : 2})
b

a    0
b    1
c    2
dtype: int64

In [14]:
### changing the index values in series:

a = pd.Series([1,2,3,45],index = ['z','x','y','a'])
a

z     1
x     2
y     3
a    45
dtype: int64

In [17]:
a = pd.Series([1,2,'a',45,6],index = np.arange(1,6))
a

1     1
2     2
3     a
4    45
5     6
dtype: object

In [18]:
a.dtype  ### o --- object datatype --> combination of numbers and alphabets.

dtype('O')

In [19]:
#### Creating data using dataframe:

a = pd.DataFrame([1,2,3,4])
a

   0
0  1
1  2
2  3
3  4

In [21]:
##### creating data with multiple columns:

a = pd.DataFrame([["Niharikaa",12,2020],["Lavanya",11,2019],["Gayathri",10,2018]])
a

           0   1     2
0  Niharikaa  12  2020
1    Lavanya  11  2019
2   Gayathri  10  2018

In [22]:
### creating multiple columns with column names:

a = pd.DataFrame([["Niharikaa",12,2020],["Lavanya",11,2019],["Gayathri",10,2018]],columns = ("Name","Age","year"))

a

        Name  Age  year
0  Niharikaa   12  2020
1    Lavanya   11  2019
2   Gayathri   10  2018

In [24]:
### Creating dataframe by dictionary :

d = {"Name" : ["Niharikaa","Mounica","Lavanya","Gayathri"],
    "Branch" : ["Ece","Cse","Ece","Ece"],
    "Year": [2020,2019,2018,2017]}
a = pd.DataFrame(d,index = ['a','b','c','d'])
a

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018
d   Gayathri    Ece  2017

In [25]:
### creating dataframe by using multiple dictionaries:

data = [{'a':10,'b':20,"c":30},{"a":30,"b":40,"c":20}]
a = pd.DataFrame(data)
a

    a   b   c
0  10  20  30
1  30  40  20

In [27]:
### Converting data Series into dataframe:
## Nan --- not a number.

d = {"one" : pd.Series([1,2,3],index = ['a','b','c']),
    "Two" : pd.Series([4,5,6,7],index = ["a","b","c","d"])}
a = pd.DataFrame(d)
a

   one  Two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

In [31]:
a = [1,2,3,4]
a = pd.DataFrame(a,dtype = 'float64')
a

     0
0  1.0
1  2.0
2  3.0
3  4.0

In [32]:
d = {"Name" : ["Niharikaa","Mounica","Lavanya","Gayathri"],
    "Branch" : ["Ece","Cse","Ece","Ece"],
    "Year": [2020,2019,2018,2017]}
a = pd.DataFrame(d,index = ['a','b','c','d'])
a

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018
d   Gayathri    Ece  2017

In [34]:
### getting all the vaules form the data frame:

a.values ### variable_name.values

array([['Niharikaa', 'Ece', 2020],
       ['Mounica', 'Cse', 2019],
       ['Lavanya', 'Ece', 2018],
       ['Gayathri', 'Ece', 2017]], dtype=object)

In [36]:
### getting all the index vaules form the data frame:

a.index  ### variable_name.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [37]:
### checking the nan values in a dataframe:

a.isnull()

    Name  Branch   Year
a  False   False  False
b  False   False  False
c  False   False  False
d  False   False  False

In [38]:
d = {"one" : pd.Series([1,2,3],index = ['a','b','c']),
    "Two" : pd.Series([4,5,6,7],index = ["a","b","c","d"])}
a = pd.DataFrame(d)
a

   one  Two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

In [39]:
a.isnull()

     one    Two
a  False  False
b  False  False
c  False  False
d   True  False

In [40]:
a.notnull()

     one   Two
a   True  True
b   True  True
c   True  True
d  False  True

In [41]:
d = {"Name" : ["Niharikaa","Mounica","Lavanya","Gayathri"],
    "Branch" : ["Ece","Cse","Ece","Ece"],
    "Year": [2020,2019,2018,2017]}
a = pd.DataFrame(d,index = ['a','b','c','d'])
a

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018
d   Gayathri    Ece  2017

In [43]:
#### accessing the elements from the dataframe :

a["Name"] ### particular column

a    Niharikaa
b      Mounica
c      Lavanya
d     Gayathri
Name: Name, dtype: object

In [44]:
a["Name"]['c'] ### getting particular value

'Lavanya'

In [45]:
a[0:3] ### first three columns

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018

In [47]:
a[-1:] #### last column

       Name Branch  Year
d  Gayathri    Ece  2017

### iloc  and loc:

* loc  --- for accessing the rows using the index datatype other than integer.
* iloc --- for accessing the rows using the index datatype integer.

In [48]:
a

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018
d   Gayathri    Ece  2017

In [49]:
a.loc['c']

Name      Lavanya
Branch        Ece
Year         2018
Name: c, dtype: object

In [51]:
a.iloc[2]

Name      Lavanya
Branch        Ece
Year         2018
Name: c, dtype: object

In [52]:
a

        Name Branch  Year
a  Niharikaa    Ece  2020
b    Mounica    Cse  2019
c    Lavanya    Ece  2018
d   Gayathri    Ece  2017